burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Include/gd32e51x_i2c.h
/*!
    \file    gd32e51x_i2c.h
    \brief   definitions for the I2C

    \version 2024-12-30, V1.2.0, firmware for GD32E51x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32E51X_I2C_H
#define GD32E51X_I2C_H

#include "gd32e51x.h"

/* I2Cx(x=0,1,2) definitions */
#define I2C0                             I2C_BASE                              /*!< I2C0 base address */
#define I2C1                             (I2C_BASE + 0x00000400U)              /*!< I2C1 base address */
#define I2C2                             (I2C_BASE + 0x00006C00U)              /*!< I2C2 base address */

/* registers definitions */
/* registers of I2Cx(x=0,1) */
#define I2C_CTL0(i2cx)                   REG32((i2cx) + 0x00000000U)           /*!< I2C control register 0 */
#define I2C_CTL1(i2cx)                   REG32((i2cx) + 0x00000004U)           /*!< I2C control register 1 */
#define I2C_SADDR0(i2cx)                 REG32((i2cx) + 0x00000008U)           /*!< I2C slave address register 0*/
#define I2C_SADDR1(i2cx)                 REG32((i2cx) + 0x0000000CU)           /*!< I2C slave address register */
#define I2C_DATA(i2cx)                   REG32((i2cx) + 0x00000010U)           /*!< I2C transfer buffer register */
#define I2C_STAT0(i2cx)                  REG32((i2cx) + 0x00000014U)           /*!< I2C transfer status register 0 */
#define I2C_STAT1(i2cx)                  REG32((i2cx) + 0x00000018U)           /*!< I2C transfer status register */
#define I2C_CKCFG(i2cx)                  REG32((i2cx) + 0x0000001CU)           /*!< I2C clock configure register */
#define I2C_RT(i2cx)                     REG32((i2cx) + 0x00000020U)           /*!< I2C rise time register */
#define I2C_SAMCS(i2cx)                  REG32((i2cx) + 0x00000080U)           /*!< I2C SAM control and status register */
#define I2C_CTL2(i2cx)                   REG32((i2cx) + 0x00000090U)           /*!< control register 2 */
#define I2C_CS(i2cx)                     REG32((i2cx) + 0x00000094U)           /*!< control and status register */
#define I2C_STATC(i2cx)                  REG32((i2cx) + 0x00000098U)           /*!< status clear register */

/* registers of I2Cx(x=2) */
#define I2C2_CTL0(i2cx)                  REG32((i2cx) + 0x00000000U)           /*!< I2C control register 0 */
#define I2C2_CTL1(i2cx)                  REG32((i2cx) + 0x00000004U)           /*!< I2C control register 1 */
#define I2C2_SADDR0(i2cx)                REG32((i2cx) + 0x00000008U)           /*!< I2C slave address register 0*/
#define I2C2_SADDR1(i2cx)                REG32((i2cx) + 0x0000000CU)           /*!< I2C slave address register 1*/
#define I2C2_TIMING(i2cx)                REG32((i2cx) + 0x00000010U)           /*!< I2C timing register */
#define I2C2_TIMEOUT(i2cx)               REG32((i2cx) + 0x00000014U)           /*!< I2C timeout register */
#define I2C2_STAT(i2cx)                  REG32((i2cx) + 0x00000018U)           /*!< I2C status register */
#define I2C2_STATC(i2cx)                 REG32((i2cx) + 0x0000001CU)           /*!< I2C status clear register */
#define I2C2_PEC(i2cx)                   REG32((i2cx) + 0x00000020U)           /*!< I2C PEC register */
#define I2C2_RDATA(i2cx)                 REG32((i2cx) + 0x00000024U)           /*!< I2C receive data register */
#define I2C2_TDATA(i2cx)                 REG32((i2cx) + 0x00000028U)           /*!< I2C transmit data register */

/* bits definitions */
/* bits definitions of I2Cx(x=0,1) */
/* I2Cx_CTL0 */
#define I2C_CTL0_I2CEN                   BIT(0)                                /*!< peripheral enable */
#define I2C_CTL0_SMBEN                   BIT(1)                                /*!< SMBus mode */
#define I2C_CTL0_SMBSEL                  BIT(3)                                /*!< SMBus type */
#define I2C_CTL0_ARPEN                   BIT(4)                                /*!< ARP enable */
#define I2C_CTL0_PECEN                   BIT(5)                                /*!< PEC enable */
#define I2C_CTL0_GCEN                    BIT(6)                                /*!< general call enable */
#define I2C_CTL0_SS                      BIT(7)                                /*!< clock stretching disable (slave mode) */
#define I2C_CTL0_START                   BIT(8)                                /*!< start generation */
#define I2C_CTL0_STOP                    BIT(9)                                /*!< stop generation */
#define I2C_CTL0_ACKEN                   BIT(10)                               /*!< acknowledge enable */
#define I2C_CTL0_POAP                    BIT(11)                               /*!< acknowledge/PEC position (for data reception) */
#define I2C_CTL0_PECTRANS                BIT(12)                               /*!< packet error checking */
#define I2C_CTL0_SALT                    BIT(13)                               /*!< SMBus alert */
#define I2C_CTL0_SRESET                  BIT(15)                               /*!< software reset */

/* I2Cx_CTL1 */
#define I2C_CTL1_I2CCLK                  BITS(0,6)                             /*!< I2CCLK[6:0] bits (peripheral clock frequency) */
#define I2C_CTL1_ERRIE                   BIT(8)                                /*!< error interrupt enable */
#define I2C_CTL1_EVIE                    BIT(9)                                /*!< event interrupt enable */
#define I2C_CTL1_BUFIE                   BIT(10)                               /*!< buffer interrupt enable */
#define I2C_CTL1_DMAON                   BIT(11)                               /*!< DMA requests enable */
#define I2C_CTL1_DMALST                  BIT(12)                               /*!< DMA last transfer */
#define I2C_CTL1_RBNECM                  BIT(15)                               /*!< RBNE clear mode */

