burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Include/gd32e51x_i2c.h
/* I2Cx_SADDR0 */
#define I2C_SADDR0_ADDRESS0              BIT(0)                                /*!< bit 0 of a 10-bit address */
#define I2C_SADDR0_ADDRESS               BITS(1,7)                             /*!< 7-bit address or bits 7:1 of a 10-bit address */
#define I2C_SADDR0_ADDRESS_H             BITS(8,9)                             /*!< highest two bits of a 10-bit address */
#define I2C_SADDR0_ADDFORMAT             BIT(15)                               /*!< address mode for the I2C slave */

/* I2Cx_SADDR1 */
#define I2C_SADDR1_DUADEN                BIT(0)                                /*!< dual-address mode switch */
#define I2C_SADDR1_ADDRESS2              BITS(1,7)                             /*!< second I2C address for the slave in dual-address mode */

/* I2Cx_DATA */
#define I2C_DATA_TRB                     BITS(0,7)                             /*!< 8-bit data register */

/* I2Cx_STAT0 */
#define I2C_STAT0_SBSEND                 BIT(0)                                /*!< start bit (master mode) */
#define I2C_STAT0_ADDSEND                BIT(1)                                /*!< address sent (master mode)/matched (slave mode) */
#define I2C_STAT0_BTC                    BIT(2)                                /*!< byte transfer finished */
#define I2C_STAT0_ADD10SEND              BIT(3)                                /*!< 10-bit header sent (master mode) */
#define I2C_STAT0_STPDET                 BIT(4)                                /*!< stop detection (slave mode) */
#define I2C_STAT0_RBNE                   BIT(6)                                /*!< data register not empty (receivers) */
#define I2C_STAT0_TBE                    BIT(7)                                /*!< data register empty (transmitters) */
#define I2C_STAT0_BERR                   BIT(8)                                /*!< bus error */
#define I2C_STAT0_LOSTARB                BIT(9)                                /*!< arbitration lost (master mode) */
#define I2C_STAT0_AERR                   BIT(10)                               /*!< acknowledge failure */
#define I2C_STAT0_OUERR                  BIT(11)                               /*!< overrun/underrun */
#define I2C_STAT0_PECERR                 BIT(12)                               /*!< PEC error in reception */
#define I2C_STAT0_SMBTO                  BIT(14)                               /*!< timeout signal in SMBus mode */
#define I2C_STAT0_SMBALT                 BIT(15)                               /*!< SMBus alert status */

/* I2Cx_STAT1 */
#define I2C_STAT1_MASTER                 BIT(0)                                /*!< master/slave */
#define I2C_STAT1_I2CBSY                 BIT(1)                                /*!< bus busy */
#define I2C_STAT1_TR                     BIT(2)                                /*!< transmitter/receiver */
#define I2C_STAT1_RXGC                   BIT(4)                                /*!< general call address (slave mode) */
#define I2C_STAT1_DEFSMB                 BIT(5)                                /*!< SMBus device default address (slave mode) */
#define I2C_STAT1_HSTSMB                 BIT(6)                                /*!< SMBus host header (slave mode) */
#define I2C_STAT1_DUMODF                 BIT(7)                                /*!< dual flag (slave mode) */
#define I2C_STAT1_PECV                   BITS(8,15)                            /*!< packet error checking value */

/* I2Cx_CKCFG */
#define I2C_CKCFG_CLKC                   BITS(0,11)                            /*!< clock control register in fast/standard mode or fast mode plus(master mode) */
#define I2C_CKCFG_DTCY                   BIT(14)                               /*!< duty cycle of fast mode or fast mode plus */
#define I2C_CKCFG_FAST                   BIT(15)                               /*!< I2C speed selection in master mode */

/* I2Cx_RT */
#define I2C_RT_RISETIME                  BITS(0,6)                             /*!< maximum rise time in fast/standard mode or fast mode plus(master mode) */

/* I2Cx_SAMCS */
#define I2C_SAMCS_SAMEN                  BIT(0)                                /*!< SAM_V interface enable */
#define I2C_SAMCS_STOEN                  BIT(1)                                /*!< SAM_V interface timeout detect enable */
#define I2C_SAMCS_TFFIE                  BIT(4)                                /*!< txframe fall interrupt enable */
#define I2C_SAMCS_TFRIE                  BIT(5)                                /*!< txframe rise interrupt enable */
#define I2C_SAMCS_RFFIE                  BIT(6)                                /*!< rxframe fall interrupt enable */
#define I2C_SAMCS_RFRIE                  BIT(7)                                /*!< rxframe rise interrupt enable */
#define I2C_SAMCS_TXF                    BIT(8)                                /*!< level of txframe signal */
#define I2C_SAMCS_RXF                    BIT(9)                                /*!< level of rxframe signal */
#define I2C_SAMCS_TFF                    BIT(12)                               /*!< txframe fall flag */
#define I2C_SAMCS_TFR                    BIT(13)                               /*!< txframe rise flag */
#define I2C_SAMCS_RFF                    BIT(14)                               /*!< rxframe fall flag */
#define I2C_SAMCS_RFR                    BIT(15)                               /*!< rxframe rise flag */

/* I2Cx_CTL2 */
#define I2C_CTL2_FMPEN                   BIT(0)                                /*!< fast mode plus enable */
#define I2C_CTL2_SETM                    BIT(1)                                /*!< start early termination mode */
#define I2C_CTL2_TOEN                    BIT(4)                                /*!< timeout calculation disable */
#define I2C_CTL2_RADD                    BIT(8)                                /*!< record received slave address to the transfer buffer register */
#define I2C_CTL2_ADDM                    BITS(9,15)                            /*!< address bit compare select */

/* I2Cx_CS */
#define I2C_CS_STLO                      BIT(0)                                /*!< start lost occurred */
#define I2C_CS_STPSEND                   BIT(1)                                /*!< stop condition sent */
#define I2C_CS_STLOIE                    BIT(8)                                /*!< start lost interrupt enable */
#define I2C_CS_STPSENDIE                 BIT(9)                                /*!< stop condition sent interrupt enable */

/* I2Cx_STATC */
#define I2C_STATC_SBSENDC                BIT(0)                                /*!< clear SBSEND bit */
#define I2C_STATC_ADDSENDC               BIT(1)                                /*!< clear ADDSEND bit */
#define I2C_STATC_BTCC                   BIT(2)                                /*!< clear BTC bit */
#define I2C_STATC_ADD10SENDC             BIT(3)                                /*!< clear ADD10SEND bit */
#define I2C_STATC_STOPFC                 BIT(4)                                /*!< clear STPDET bit */
#define I2C_STATC_SRCEN                  BIT(15)                               /*!< Status register clear enable */

/* bits definitions of I2Cx(x=2) */
/* I2Cx_CTL0 */
#define I2C2_CTL0_I2CEN                  BIT(0)                                /*!< I2C peripheral enable */
#define I2C2_CTL0_TIE                    BIT(1)                                /*!< transmit interrupt enable */
#define I2C2_CTL0_RBNEIE                 BIT(2)                                /*!< receive interrupt enable */
#define I2C2_CTL0_ADDMIE                 BIT(3)                                /*!< address match interrupt enable in slave mode */
#define I2C2_CTL0_NACKIE                 BIT(4)                                /*!< not acknowledge received interrupt enable */
#define I2C2_CTL0_STPDETIE               BIT(5)                                /*!< stop detection interrupt enable */
#define I2C2_CTL0_TCIE                   BIT(6)                                /*!< transfer complete interrupt enable */
#define I2C2_CTL0_ERRIE                  BIT(7)                                /*!< error interrupt enable */
#define I2C2_CTL0_DNF                    BITS(8,11)                            /*!< digital noise filter */
#define I2C2_CTL0_ANOFF                  BIT(12)                               /*!< analog noise filter */
#define I2C2_CTL0_DENT                   BIT(14)                               /*!< DMA enable for transmission */
#define I2C2_CTL0_DENR                   BIT(15)                               /*!< DMA enable for reception */
#define I2C2_CTL0_SBCTL                  BIT(16)                               /*!< slave byte control */
#define I2C2_CTL0_SS                     BIT(17)                               /*!< whether to stretch SCL low when data is not ready in slave mode */
#define I2C2_CTL0_WUEN                   BIT(18)                               /*!< wakeup from Deep-sleep mode enable */
#define I2C2_CTL0_GCEN                   BIT(19)                               /*!< whether or not to response to a General Call (0x00) */
#define I2C2_CTL0_SMBHAEN                BIT(20)                               /*!< SMBus host address enable */
#define I2C2_CTL0_SMBDAEN                BIT(21)                               /*!< SMBus device default address enable */
#define I2C2_CTL0_SMBALTEN               BIT(22)                               /*!< SMBus alert enable */
#define I2C2_CTL0_PECEN                  BIT(23)                               /*!< PEC calculation switch */

/* I2Cx_CTL1 */
#define I2C2_CTL1_SADDRESS               BITS(0,9)                             /*!< received slave address */
#define I2C2_CTL1_TRDIR                  BIT(10)                               /*!< transfer direction in master mode */
#define I2C2_CTL1_ADD10EN                BIT(11)                               /*!< 10-bit addressing mode enable in master mode */
#define I2C2_CTL1_HEAD10R                BIT(12)                               /*!< 10-bit address header executes read direction only in master receive mode */
#define I2C2_CTL1_START                  BIT(13)                               /*!< generate a START condition on I2C bus */
#define I2C2_CTL1_STOP                   BIT(14)                               /*!< generate a STOP condition on I2C bus */
#define I2C2_CTL1_NACKEN                 BIT(15)                               /*!< generate NACK in slave mode */
#define I2C2_CTL1_BYTENUM                BITS(16,23)                           /*!< number of bytes to be transferred */
#define I2C2_CTL1_RELOAD                 BIT(24)                               /*!< reload mode enable */
#define I2C2_CTL1_AUTOEND                BIT(25)                               /*!< automatic end mode in master mode */
#define I2C2_CTL1_PECTRANS               BIT(26)                               /*!< PEC transfer */

