burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Include/gd32e51x_i2c.h
/* I2Cx_SADDR0 */
#define I2C2_SADDR0_ADDRESS0             BIT(0)                                /*!< bit 0 of a 10-bit address */
#define I2C2_SADDR0_ADDRESS              BITS(1,7)                             /*!< 7-bit address or bits 7:1 of a 10-bit address */
#define I2C2_SADDR0_ADDRESS_H            BITS(8,9)                             /*!< highest two bits of a 10-bit address */
#define I2C2_SADDR0_ADDFORMAT            BIT(10)                               /*!< address mode for the I2C slave */
#define I2C2_SADDR0_ADDRESSEN            BIT(15)                               /*!< I2C address enable */

/* I2Cx_SADDR1 */
#define I2C2_SADDR1_ADDRESS2             BITS(1,7)                             /*!< second I2C address for the slave */
#define I2C2_SADDR1_ADDMSK2              BITS(8,10)                            /*!< ADDRESS2[7:1] mask */
#define I2C2_SADDR1_ADDRESS2EN           BIT(15)                               /*!< second I2C address enable */

/* I2Cx_TIMING */
#define I2C2_TIMING_SCLL                 BITS(0,7)                             /*!< SCL low period */
#define I2C2_TIMING_SCLH                 BITS(8,15)                            /*!< SCL high period */
#define I2C2_TIMING_SDADELY              BITS(16,19)                           /*!< data hold time */
#define I2C2_TIMING_SCLDELY              BITS(20,23)                           /*!< data setup time */
#define I2C2_TIMING_PSC                  BITS(28,31)                           /*!< timing prescaler */

/* I2Cx_TIMEOUT */
#define I2C2_TIMEOUT_BUSTOA              BITS(0,11)                            /*!< bus timeout A */
#define I2C2_TIMEOUT_TOIDLE              BIT(12)                               /*!< idle clock timeout detection */
#define I2C2_TIMEOUT_TOEN                BIT(15)                               /*!< clock timeout detection enable */
#define I2C2_TIMEOUT_BUSTOB              BITS(16,27)                           /*!< bus timeout B */
#define I2C2_TIMEOUT_EXTOEN              BIT(31)                               /*!< extended clock timeout detection enable */

/* I2Cx_STAT */
#define I2C2_STAT_TBE                    BIT(0)                                /*!< I2C_TDATA is empty during transmitting */
#define I2C2_STAT_TI                     BIT(1)                                /*!< transmit interrupt */
#define I2C2_STAT_RBNE                   BIT(2)                                /*!< I2C_RDATA is not empty during receiving */
#define I2C2_STAT_ADDSEND                BIT(3)                                /*!< address received matches in slave mode */
#define I2C2_STAT_NACK                   BIT(4)                                /*!< not acknowledge flag */
#define I2C2_STAT_STPDET                 BIT(5)                                /*!< STOP condition detected in slave mode */
#define I2C2_STAT_TC                     BIT(6)                                /*!< transfer complete in master mode */
#define I2C2_STAT_TCR                    BIT(7)                                /*!< transfer complete reload */
#define I2C2_STAT_BERR                   BIT(8)                                /*!< bus error */
#define I2C2_STAT_LOSTARB                BIT(9)                                /*!< arbitration lost */
#define I2C2_STAT_OUERR                  BIT(10)                               /*!< overrun/underrun error in slave mode */
#define I2C2_STAT_PECERR                 BIT(11)                               /*!< PEC error */
#define I2C2_STAT_TIMEOUT                BIT(12)                               /*!< timeout flag */
#define I2C2_STAT_SMBALT                 BIT(13)                               /*!< SMBus Alert */
#define I2C2_STAT_I2CBSY                 BIT(15)                               /*!< busy flag */
#define I2C2_STAT_TR                     BIT(16)                               /*!< whether the I2C is a transmitter or a receiver in slave mode */
#define I2C2_STAT_READDR                 BITS(17,23)                           /*!< received match address in slave mode */

/* I2Cx_STATC */
#define I2C2_STATC_ADDSENDC              BIT(3)                                /*!< ADDSEND flag clear */
#define I2C2_STATC_NACKC                 BIT(4)                                /*!< not acknowledge flag clear */
#define I2C2_STATC_STPDETC               BIT(5)                                /*!< STPDET flag clear */
#define I2C2_STATC_BERRC                 BIT(8)                                /*!< bus error flag clear */
#define I2C2_STATC_LOSTARBC              BIT(9)                                /*!< arbitration Lost flag clear */
#define I2C2_STATC_OUERRC                BIT(10)                               /*!< overrun/underrun flag clear */
#define I2C2_STATC_PECERRC               BIT(11)                               /*!< PEC error flag clear */
#define I2C2_STATC_TIMEOUTC              BIT(12)                               /*!< TIMEOUT flag clear */
#define I2C2_STATC_SMBALTC               BIT(13)                               /*!< SMBus Alert flag clear */

/* I2Cx_PEC */
#define I2C2_PEC_PECV                    BITS(0,7)                             /*!< Packet Error Checking Value that calculated by hardware when PEC is enabled */

/* I2Cx_RDATA */
#define I2C2_RDATA_RDATA                 BITS(0,7)                             /*!< receive data value */

/* I2Cx_TDATA */
#define I2C2_TDATA_TDATA                 BITS(0,7)                             /*!< transmit data value */

/* constants definitions */
/* define the I2C bit position and its register index offset */
#define I2C_REGIDX_BIT(regidx, bitpos)  (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define I2C_REG_VAL(i2cx, offset)       (REG32((i2cx) + (((uint32_t)(offset) & 0x0000FFFFU) >> 6)))
#define I2C_BIT_POS(val)                ((uint32_t)(val) & 0x0000001FU)
#define I2C_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22) | (uint32_t)((bitpos2) << 16)\
                                                              | (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos)))
#define I2C_REG_VAL2(i2cx, offset)      (REG32((i2cx) + ((uint32_t)(offset) >> 22)))
#define I2C_BIT_POS2(val)               (((uint32_t)(val) & 0x001F0000U) >> 16)

/* register offset */
/* register offset of I2Cx(x=0,1) */
#define I2C_CTL1_REG_OFFSET              ((uint32_t)0x00000004U)               /*!< CTL1 register offset */
#define I2C_STAT0_REG_OFFSET             ((uint32_t)0x00000014U)               /*!< STAT0 register offset */
#define I2C_STAT1_REG_OFFSET             ((uint32_t)0x00000018U)               /*!< STAT1 register offset */
#define I2C_SAMCS_REG_OFFSET             ((uint32_t)0x00000080U)               /*!< SAMCS register offset */
#define I2C_CTL2_REG_OFFSET              ((uint32_t)0x00000090U)               /*!< CTL2 register offset */
#define I2C_CS_REG_OFFSET                ((uint32_t)0x00000094U)               /*!< control and status register offset */
#define I2C_STATC_REG_OFFSET             ((uint32_t)0x00000098U)               /*!< status clear register offset */
/* register offset of I2Cx(x=2) */
#define I2C2_CTL0_REG_OFFSET             ((uint32_t)0x00000000U)               /*!< CTL0 register offset */
#define I2C2_STAT_REG_OFFSET             ((uint32_t)0x00000018U)               /*!< STAT register offset */

/* I2C flag definitions */
/* I2C flag definitions of I2Cx(x=0,1) */
typedef enum {
    /* flags in STAT0 register */
    I2C_FLAG_SBSEND = I2C_REGIDX_BIT(I2C_STAT0_REG_OFFSET, 0U),                /*!< start condition sent out in master mode */
    I2C_FLAG_ADDSEND = I2C_REGIDX_BIT(I2C_STAT0_REG_OFFSET, 1U),               /*!< address is sent in master mode or received and matches in slave mode */
    I2C_FLAG_BTC = I2C_REGIDX_BIT(I2C_STAT0_REG_OFFSET, 2U),                   /*!< byte transmission finishes */
    I2C_FLAG_ADD10SEND = I2C_REGIDX_BIT(I2C_STAT0_REG_OFFSET, 3U),             /*!< header of 10-bit address is sent in master mode */
    I2C_FLAG_STPDET = I2C_REGIDX_BIT(I2C_STAT0_REG_OFFSET, 4U),                /*!< stop condition detected in slave mode */
    I2C_FLAG_RBNE = I2C_REGIDX_BIT(I2C_STAT0_REG_OFFSET, 6U),                  /*!< I2C_DATA is not Empty during receiving */
    I2C_FLAG_TBE = I2C_REGIDX_BIT(I2C_STAT0_REG_OFFSET, 7U),                   /*!< I2C_DATA is empty during transmitting */
    I2C_FLAG_BERR = I2C_REGIDX_BIT(I2C_STAT0_REG_OFFSET, 8U),                  /*!< a bus error occurs indication a unexpected start or stop condition on I2C bus */
    I2C_FLAG_LOSTARB = I2C_REGIDX_BIT(I2C_STAT0_REG_OFFSET, 9U),               /*!< arbitration lost in master mode */
    I2C_FLAG_AERR = I2C_REGIDX_BIT(I2C_STAT0_REG_OFFSET, 10U),                 /*!< acknowledge error */
    I2C_FLAG_OUERR = I2C_REGIDX_BIT(I2C_STAT0_REG_OFFSET, 11U),                /*!< over-run or under-run situation occurs in slave mode */
    I2C_FLAG_PECERR = I2C_REGIDX_BIT(I2C_STAT0_REG_OFFSET, 12U),               /*!< PEC error when receiving data */
    I2C_FLAG_SMBTO = I2C_REGIDX_BIT(I2C_STAT0_REG_OFFSET, 14U),                /*!< timeout signal in SMBus mode */
    I2C_FLAG_SMBALT = I2C_REGIDX_BIT(I2C_STAT0_REG_OFFSET, 15U),               /*!< SMBus alert status */
    /* flags in STAT1 register */
    I2C_FLAG_MASTER = I2C_REGIDX_BIT(I2C_STAT1_REG_OFFSET, 0U),                /*!< a flag indicating whether I2C block is in master or slave mode */
    I2C_FLAG_I2CBSY = I2C_REGIDX_BIT(I2C_STAT1_REG_OFFSET, 1U),                /*!< busy flag */
    I2C_FLAG_TR = I2C_REGIDX_BIT(I2C_STAT1_REG_OFFSET, 2U),                    /*!< whether the I2C is a transmitter or a receiver */
    I2C_FLAG_RXGC = I2C_REGIDX_BIT(I2C_STAT1_REG_OFFSET, 4U),                  /*!< general call address (00h) received */
    I2C_FLAG_DEFSMB = I2C_REGIDX_BIT(I2C_STAT1_REG_OFFSET, 5U),                /*!< default address of SMBus device */
    I2C_FLAG_HSTSMB = I2C_REGIDX_BIT(I2C_STAT1_REG_OFFSET, 6U),                /*!< SMBus host header detected in slave mode */
    I2C_FLAG_DUMOD = I2C_REGIDX_BIT(I2C_STAT1_REG_OFFSET, 7U),                 /*!< dual flag in slave mode indicating which address is matched in dual-address mode */
    /* flags in SAMCS register */
    I2C_FLAG_TFF = I2C_REGIDX_BIT(I2C_SAMCS_REG_OFFSET, 12U),                  /*!< txframe fall flag */
    I2C_FLAG_TFR = I2C_REGIDX_BIT(I2C_SAMCS_REG_OFFSET, 13U),                  /*!< txframe rise flag */
    I2C_FLAG_RFF = I2C_REGIDX_BIT(I2C_SAMCS_REG_OFFSET, 14U),                  /*!< rxframe fall flag */
    I2C_FLAG_RFR = I2C_REGIDX_BIT(I2C_SAMCS_REG_OFFSET, 15U),                  /*!< rxframe rise flag */
    /* flags in control and status register */
    I2C_FLAG_STLO = I2C_REGIDX_BIT(I2C_CS_REG_OFFSET, 0U),                     /*!< start lost flag */
    I2C_FLAG_STPSEND = I2C_REGIDX_BIT(I2C_CS_REG_OFFSET, 1U)                   /*!< stop condition sent flag */
} i2c_flag_enum;

